enginious-dev/ANTiPoDE/lib/Devices/p32mx2xxfxxxb.h
#define _IPC_CTIS_POSITION   _IPC0_CTIS_POSITION
#define _IPC_CTIP_POSITION   _IPC0_CTIP_POSITION
#define _IPC_CS0IS_POSITION  _IPC0_CS0IS_POSITION
#define _IPC_CS0IP_POSITION  _IPC0_CS0IP_POSITION
#define _IPC_CS1IS_POSITION  _IPC0_CS1IS_POSITION
#define _IPC_CS1IP_POSITION  _IPC0_CS1IP_POSITION
#define _IPC_INT0IS_POSITION _IPC0_INT0IS_POSITION
#define _IPC_INT0IP_POSITION _IPC0_INT0IP_POSITION
#define _IPC_T1IS_POSITION   _IPC1_T1IS_POSITION
#define _IPC_T1IP_POSITION   _IPC1_T1IP_POSITION
#define _IPC_IC1IS_POSITION  _IPC1_IC1IS_POSITION
#define _IPC_IC1IP_POSITION  _IPC1_IC1IP_POSITION
#define _IPC_OC1IS_POSITION  _IPC1_OC1IS_POSITION
#define _IPC_OC1IP_POSITION  _IPC1_OC1IP_POSITION
#define _IPC_INT1IS_POSITION _IPC1_INT1IS_POSITION
#define _IPC_INT1IP_POSITION _IPC1_INT1IP_POSITION
#define _IPC_T2IS_POSITION   _IPC2_T2IS_POSITION
#define _IPC_T2IP_POSITION   _IPC2_T2IP_POSITION
#define _IPC_IC2IS_POSITION  _IPC2_IC2IS_POSITION
#define _IPC_IC2IP_POSITION  _IPC2_IC2IP_POSITION
#define _IPC_OC2IS_POSITION  _IPC2_OC2IS_POSITION
#define _IPC_OC2IP_POSITION  _IPC2_OC2IP_POSITION
#define _IPC_INT2IS_POSITION _IPC2_INT2IS_POSITION
#define _IPC_INT2IP_POSITION _IPC2_INT2IP_POSITION
#define _IPC_T3IS_POSITION   _IPC3_T3IS_POSITION
#define _IPC_T3IP_POSITION   _IPC3_T3IP_POSITION
#define _IPC_IC3IS_POSITION  _IPC3_IC3IS_POSITION
#define _IPC_IC3IP_POSITION  _IPC3_IC3IP_POSITION
#define _IPC_OC3IS_POSITION  _IPC3_OC3IS_POSITION
#define _IPC_OC3IP_POSITION  _IPC3_OC3IP_POSITION
#define _IPC_INT3IS_POSITION _IPC3_INT3IS_POSITION
#define _IPC_INT3IP_POSITION _IPC3_INT3IP_POSITION
#define _IPC_T4IS_POSITION   _IPC4_T4IS_POSITION
#define _IPC_T4IP_POSITION   _IPC4_T4IP_POSITION
#define _IPC_IC4IS_POSITION  _IPC4_IC4IS_POSITION
#define _IPC_IC4IP_POSITION  _IPC4_IC4IP_POSITION
#define _IPC_OC4IS_POSITION  _IPC4_OC4IS_POSITION
#define _IPC_OC4IP_POSITION  _IPC4_OC4IP_POSITION
#define _IPC_INT4IS_POSITION _IPC4_INT4IS_POSITION
#define _IPC_INT4IP_POSITION _IPC4_INT4IP_POSITION
#define _IPC_T5IS_POSITION   _IPC5_T5IS_POSITION
#define _IPC_T5IP_POSITION   _IPC5_T5IP_POSITION
#define _IPC_IC5IS_POSITION  _IPC5_IC5IS_POSITION
#define _IPC_IC5IP_POSITION  _IPC5_IC5IP_POSITION
#define _IPC_OC5IS_POSITION  _IPC5_OC5IS_POSITION
#define _IPC_OC5IP_POSITION  _IPC5_OC5IP_POSITION
#define _IPC_AD1IS_POSITION  _IPC5_AD1IS_POSITION
#define _IPC_AD1IP_POSITION  _IPC5_AD1IP_POSITION
#define _IPC_FSCMIS_POSITION _IPC6_FSCMIS_POSITION
#define _IPC_FSCMIP_POSITION _IPC6_FSCMIP_POSITION
#define _IPC_RTCCIS_POSITION _IPC6_RTCCIS_POSITION
#define _IPC_RTCCIP_POSITION _IPC6_RTCCIP_POSITION
#define _IPC_FCEIS_POSITION  _IPC6_FCEIS_POSITION
#define _IPC_FCEIP_POSITION  _IPC6_FCEIP_POSITION
#define _IPC_CMP1IS_POSITION _IPC6_CMP1IS_POSITION
#define _IPC_CMP1IP_POSITION _IPC6_CMP1IP_POSITION
#define _IPC_CMP2IS_POSITION _IPC7_CMP2IS_POSITION
#define _IPC_CMP2IP_POSITION _IPC7_CMP2IP_POSITION
#define _IPC_CMP3IS_POSITION _IPC7_CMP3IS_POSITION
#define _IPC_CMP3IP_POSITION _IPC7_CMP3IP_POSITION
#define _IPC_USBIS_POSITION  _IPC7_USBIS_POSITION
#define _IPC_USBIP_POSITION  _IPC7_USBIP_POSITION
#define _IPC_SPI1IS_POSITION _IPC7_SPI1IS_POSITION
#define _IPC_SPI1IP_POSITION _IPC7_SPI1IP_POSITION
#define _IPC_U1IS_POSITION   _IPC8_U1IS_POSITION
#define _IPC_U1IP_POSITION   _IPC8_U1IP_POSITION
#define _IPC_I2C1IS_POSITION _IPC8_I2C1IS_POSITION
#define _IPC_I2C1IP_POSITION _IPC8_I2C1IP_POSITION
#define _IPC_CNIS_POSITION   _IPC8_CNIS_POSITION
#define _IPC_CNIP_POSITION   _IPC8_CNIP_POSITION
#define _IPC_PMPIS_POSITION  _IPC8_PMPIS_POSITION
#define _IPC_PMPIP_POSITION  _IPC8_PMPIP_POSITION
#define _IPC_SPI2IS_POSITION _IPC9_SPI2IS_POSITION
#define _IPC_SPI2IP_POSITION _IPC9_SPI2IP_POSITION
#define _IPC_U2IS_POSITION   _IPC9_U2IS_POSITION
#define _IPC_U2IP_POSITION   _IPC9_U2IP_POSITION
#define _IPC_I2C2IS_POSITION _IPC9_I2C2IS_POSITION
#define _IPC_I2C2IP_POSITION _IPC9_I2C2IP_POSITION
#define _IPC_CTMUIS_POSITION _IPC9_CTMUIS_POSITION
#define _IPC_CTMUIP_POSITION _IPC9_CTMUIP_POSITION
#define _IPC_DMA0IS_POSITION _IPC10_DMA0IS_POSITION
#define _IPC_DMA0IP_POSITION _IPC10_DMA0IP_POSITION
#define _IPC_DMA1IS_POSITION _IPC10_DMA1IS_POSITION
#define _IPC_DMA1IP_POSITION _IPC10_DMA1IP_POSITION
#define _IPC_DMA2IS_POSITION _IPC10_DMA2IS_POSITION
#define _IPC_DMA2IP_POSITION _IPC10_DMA2IP_POSITION
#define _IPC_DMA3IS_POSITION _IPC10_DMA3IS_POSITION
#define _IPC_DMA3IP_POSITION _IPC10_DMA3IP_POSITION

// I2C CONSTANTS
#define _I2C_PULSE_GOBBLER_DELAY_TIME 0.00000013

// PPS CONSTANTS
#define _PPS_INVEC_MAX  46
#define _PPS_OUTVEC_MAX 37

// PPS INPUT GROUPS
#define _PPS_INPUT_GROUP_0        0x00000000 // (15 << _PPS_INPUT_GROUP_POSITION[ = 8])
#define _PPS_INPUT_GROUP_1        0x00000100 // (1  << _PPS_INPUT_GROUP_POSITION[ = 8])
#define _PPS_INPUT_GROUP_2        0x00000200 // (2  << _PPS_INPUT_GROUP_POSITION[ = 8])
#define _PPS_INPUT_GROUP_3        0x00000400 // (4  << _PPS_INPUT_GROUP_POSITION[ = 8])
#define _PPS_INPUT_GROUP_4        0x00000800 // (8  << _PPS_INPUT_GROUP_POSITION[ = 8])

// PPS OUTPUT GROUPS
#define _PPS_OUTPUT_GROUP_0        0x00000000 // (0  << _PPS_OUTPUT_GROUP_POSITION[ = 12])
#define _PPS_OUTPUT_GROUP_1        0x00001000 // (1  << _PPS_OUTPUT_GROUP_POSITION[ = 12])
#define _PPS_OUTPUT_GROUP_2        0x00002000 // (2  << _PPS_OUTPUT_GROUP_POSITION[ = 12])
#define _PPS_OUTPUT_GROUP_3        0x00004000 // (4  << _PPS_OUTPUT_GROUP_POSITION[ = 12])
#define _PPS_OUTPUT_GROUP_4        0x00008000 // (8  << _PPS_OUTPUT_GROUP_POSITION[ = 12])

// PPS VALUES
#define _PPS_VALUE_0        0x00000000 // (0  << _PPS_TYPE_POSITION[ = 18])
#define _PPS_VALUE_1        0x00040000 // (1  << _PPS_TYPE_POSITION[ = 18])
#define _PPS_VALUE_2        0x00080000 // (2  << _PPS_TYPE_POSITION[ = 18])
#define _PPS_VALUE_3        0x000C0000 // (3  << _PPS_TYPE_POSITION[ = 18])
#define _PPS_VALUE_4        0x00100000 // (4  << _PPS_TYPE_POSITION[ = 18])
#define _PPS_VALUE_5        0x00140000 // (5  << _PPS_TYPE_POSITION[ = 18])
#define _PPS_VALUE_6        0x00180000 // (6  << _PPS_TYPE_POSITION[ = 18])
#define _PPS_VALUE_7        0x001C0000 // (7  << _PPS_TYPE_POSITION[ = 18])

// PPS VECTOR INDEXES
#define _PPS_VECTOR_INDEX_0  0
#define _PPS_VECTOR_INDEX_1  1
#define _PPS_VECTOR_INDEX_2  2
#define _PPS_VECTOR_INDEX_3  3
#define _PPS_VECTOR_INDEX_4  4
#define _PPS_VECTOR_INDEX_5  5
#define _PPS_VECTOR_INDEX_6  6
#define _PPS_VECTOR_INDEX_7  7
#define _PPS_VECTOR_INDEX_8  8
#define _PPS_VECTOR_INDEX_9  9
#define _PPS_VECTOR_INDEX_10 10
#define _PPS_VECTOR_INDEX_11 11
#define _PPS_VECTOR_INDEX_12 12
#define _PPS_VECTOR_INDEX_13 13
#define _PPS_VECTOR_INDEX_14 14
#define _PPS_VECTOR_INDEX_15 15
#define _PPS_VECTOR_INDEX_16 16
#define _PPS_VECTOR_INDEX_17 17
#define _PPS_VECTOR_INDEX_18 18
#define _PPS_VECTOR_INDEX_19 19
#define _PPS_VECTOR_INDEX_20 20
#define _PPS_VECTOR_INDEX_21 21
#define _PPS_VECTOR_INDEX_22 22
#define _PPS_VECTOR_INDEX_23 23
#define _PPS_VECTOR_INDEX_24 24
#define _PPS_VECTOR_INDEX_25 25
#define _PPS_VECTOR_INDEX_26 26
#define _PPS_VECTOR_INDEX_27 27
#define _PPS_VECTOR_INDEX_28 28
#define _PPS_VECTOR_INDEX_29 29
#define _PPS_VECTOR_INDEX_30 30
#define _PPS_VECTOR_INDEX_31 31
#define _PPS_VECTOR_INDEX_32 32
#define _PPS_VECTOR_INDEX_33 33
#define _PPS_VECTOR_INDEX_34 34
#define _PPS_VECTOR_INDEX_35 35
#define _PPS_VECTOR_INDEX_36 36
#define _PPS_VECTOR_INDEX_37 37
#define _PPS_VECTOR_INDEX_38 38
#define _PPS_VECTOR_INDEX_39 39
#define _PPS_VECTOR_INDEX_40 40
#define _PPS_VECTOR_INDEX_41 41
#define _PPS_VECTOR_INDEX_42 42
#define _PPS_VECTOR_INDEX_43 43
#define _PPS_VECTOR_INDEX_44 44
#define _PPS_VECTOR_INDEX_45 45
#define _PPS_VECTOR_INDEX_46 46
#define _PPS_VECTOR_INDEX_47 47
#define _PPS_VECTOR_INDEX_48 48

// PPS PORT PINS
#define RPA0            (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_0)
#define RPA1            (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_2 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_1)
#define RPA2            (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_2)
#define RPA3            (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_3)
#define RPA4            (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_2 | _PPS_VECTOR_INDEX_4)
// #define RPA8            (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_2 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_5 | _PPS_VECTOR_INDEX_8)
// #define RPA9            (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_2 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_7 | _PPS_VECTOR_INDEX_9)
#define RPB0            (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_2 | _PPS_VECTOR_INDEX_11)
#define RPB1            (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_2 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_2 | _PPS_VECTOR_INDEX_12)
#define RPB2            (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_4 | _PPS_VECTOR_INDEX_13)
#define RPB3            (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_1 | _PPS_VECTOR_INDEX_14)
#define RPB4            (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_2 | _PPS_VECTOR_INDEX_15)
#define RPB5            (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_2 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_1 | _PPS_VECTOR_INDEX_16)
// #define RPB6            (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_1 | _PPS_VECTOR_INDEX_17)
#define RPB7            (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_4 | _PPS_VECTOR_INDEX_18)
#define RPB8            (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_2 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_4 | _PPS_VECTOR_INDEX_19)
#define RPB9            (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_4 | _PPS_VECTOR_INDEX_20)
#define RPB10           (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_3 | _PPS_VECTOR_INDEX_21)
#define RPB11           (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_2 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_3 | _PPS_VECTOR_INDEX_22)
#define RPB13           (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_3 | _PPS_VECTOR_INDEX_24)
#define RPB14           (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_1 | _PPS_VECTOR_INDEX_25)
#define RPB15           (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_3 | _PPS_VECTOR_INDEX_26)
// #define RPC0            (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_6 | _PPS_VECTOR_INDEX_27)
// #define RPC1            (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_6 | _PPS_VECTOR_INDEX_28)
// #define RPC2            (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_6 | _PPS_VECTOR_INDEX_29)
// #define RPC3            (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_7 | _PPS_VECTOR_INDEX_30)
// #define RPC4            (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_7 | _PPS_VECTOR_INDEX_31)
// #define RPC5            (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_7 | _PPS_VECTOR_INDEX_32)
// #define RPC6            (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_5 | _PPS_VECTOR_INDEX_33)
// #define RPC7            (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_5 | _PPS_VECTOR_INDEX_34)
// #define RPC8            (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_2 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_6 | _PPS_VECTOR_INDEX_35)
// #define RPC9            (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_PORT_PIN | _PPS_VALUE_5 | _PPS_VECTOR_INDEX_36)

