enginious-dev/ANTiPoDE/lib/Devices/p32mx2xxfxxxb.h
// PPS INPUTS
#define INT1             (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_0)
#define INT2             (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_1)
#define INT3             (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_2)
#define INT4             (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_3)
#define T2CK             (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_5)
#define T3CK             (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_6)
#define T4CK             (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_7)
#define T5CK             (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_8)
#define IC1              (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_9)
#define IC2              (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_10)
#define IC3              (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_11)
#define IC4              (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_12)
#define IC5              (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_13)
#define OCFA             (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_17)
#define OCFB             (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_18)
#define U1RX             (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_19)
#define U1CTS            (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_20)
#define U2RX             (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_21)
#define U2CTS            (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_22)
#define SDI1             (_PPS_INPUT_GROUP_2 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_32)
#define SS1              (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_33)
#define SDI2             (_PPS_INPUT_GROUP_3 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_35)
#define SS2              (_PPS_INPUT_GROUP_4 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_36)
#define REFCLKI          (_PPS_INPUT_GROUP_1 | _PPS_OUTPUT_GROUP_0 | _PPS_TYPE_INPUT | _PPS_VALUE_0 | _PPS_VECTOR_INDEX_45)

// PPS OUTPUTS
#define U1TX             (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_OUTPUT | _PPS_VALUE_1 | _PPS_VECTOR_INDEX_0)
#define U2RTS            (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_OUTPUT | _PPS_VALUE_2 | _PPS_VECTOR_INDEX_0)
#define SS1OUT           (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_OUTPUT | _PPS_VALUE_3 | _PPS_VECTOR_INDEX_0)
#define OC1              (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_OUTPUT | _PPS_VALUE_5 | _PPS_VECTOR_INDEX_0)
#define C2OUT            (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_1 | _PPS_TYPE_OUTPUT | _PPS_VALUE_7 | _PPS_VECTOR_INDEX_0)
#define OC2              (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_2 | _PPS_TYPE_OUTPUT | _PPS_VALUE_5 | _PPS_VECTOR_INDEX_0)
#define C3OUT            (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_2 | _PPS_TYPE_OUTPUT | _PPS_VALUE_7 | _PPS_VECTOR_INDEX_0)
#define OC4              (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_OUTPUT | _PPS_VALUE_5 | _PPS_VECTOR_INDEX_0)
#define OC5              (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_OUTPUT | _PPS_VALUE_6 | _PPS_VECTOR_INDEX_0)
#define REFCLKO          (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_OUTPUT | _PPS_VALUE_7 | _PPS_VECTOR_INDEX_0)
#define SDO1             (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_2 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_OUTPUT | _PPS_VALUE_3 | _PPS_VECTOR_INDEX_0)
#define SDO2             (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_2 | _PPS_OUTPUT_GROUP_3 | _PPS_TYPE_OUTPUT | _PPS_VALUE_4 | _PPS_VECTOR_INDEX_0)
#define U1RTS            (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_OUTPUT | _PPS_VALUE_1 | _PPS_VECTOR_INDEX_0)
#define U2TX             (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_OUTPUT | _PPS_VALUE_2 | _PPS_VECTOR_INDEX_0)
#define SS2OUT           (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_OUTPUT | _PPS_VALUE_4 | _PPS_VECTOR_INDEX_0)
#define OC3              (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_OUTPUT | _PPS_VALUE_5 | _PPS_VECTOR_INDEX_0)
#define C1OUT            (_PPS_INPUT_GROUP_0 | _PPS_OUTPUT_GROUP_4 | _PPS_TYPE_OUTPUT | _PPS_VALUE_7 | _PPS_VECTOR_INDEX_0)

// SYSKEY
#define SYSKEY_UNLOCK_SIZE 3
#define SYSKEY_UNLOCK_0    0x00000000
#define SYSKEY_UNLOCK_1    0xAA996655
#define SYSKEY_UNLOCK_2    0x556699AA

#define SYSKEY_LOCK_SIZE   1
#define SYSKEY_LOCK_0      0x00000000

/**
 * I/O PORTS
 */
__asm__ volatile ("_PORTA_W = 0xBF886000");
__asm__ volatile (".global _PORTA_W");
__asm__ volatile ("_PORTB_W = 0xBF886100");
__asm__ volatile (".global _PORTB_W");

/**
 * Interrupt
 */
__asm__ volatile ("_INT_W = 0xBF881000");
__asm__ volatile (".global _INT_W");

/**
 * I2C
 */
__asm__ volatile ("_I2C1_W = 0xBF885000");
__asm__ volatile (".global _I2C1_W");
__asm__ volatile ("_I2C2_W = 0xBF885100");
__asm__ volatile (".global _I2C2_W");

/**
 * Configuration Bits
 */
__asm__ volatile ("_DEVCFG_W = 0xBF80F200");
__asm__ volatile (".global _DEVCFG_W");

/**
 * PPS
 */
__asm__ volatile ("_PPS_IN_W = 0xBF80FA04");
__asm__ volatile (".global _PPS_IN_W");

