enginious-dev/ANTiPoDE/lib/Devices/p32mx2xxfxxxb.h
__asm__ volatile ("_PPS_OUT_W = 0xBF80FB00");
__asm__ volatile (".global _PPS_OUT_W");

namespace Antipode {

    extern volatile PortRegister PORTA_W __asm__("_PORTA_W") __attribute__((section("sfrs")));
    PhysicalPort portA = PhysicalPort(PORTA_W);

    extern volatile PortRegister PORTB_W __asm__("_PORTB_W") __attribute__((section("sfrs")));
    PhysicalPort portB = PhysicalPort(PORTB_W);

    extern volatile InterruptRegister<_IFSVEC_MAX, _IECVEC_MAX, _IPCVEC_MAX> INT_W __asm__("_INT_W") __attribute__((section("sfrs")));
    InterruptController<_IFSVEC_MAX, _IECVEC_MAX, _IPCVEC_MAX> interruptController = InterruptController<_IFSVEC_MAX, _IECVEC_MAX, _IPCVEC_MAX>(INT_W, _INTCON_MVEC_MASK);

    extern volatile I2cRegister I2C1_W __asm__("_I2C1_W") __attribute__((section("sfrs")));
    OutputBit sda1 = OutputBit(portB, BIT_9, false);
    OutputBit scl1 = OutputBit(portB, BIT_8, false);
    I2cModule i2c1 = I2cModule(I2C1_W, sda1, scl1, _I2C_PULSE_GOBBLER_DELAY_TIME);

    extern volatile I2cRegister I2C2_W __asm__("_I2C2_W") __attribute__((section("sfrs")));
    OutputBit sda2 = OutputBit(portB, BIT_2, false);
    OutputBit scl2 = OutputBit(portB, BIT_3, false);
    I2cModule i2c2 = I2cModule(I2C2_W, sda2, scl2, _I2C_PULSE_GOBBLER_DELAY_TIME);

    CoreTimer coreTimer = CoreTimer(_IFSVEC_CTIF_INDEX, _IECVEC_CTIE_INDEX, _IPCVEC_CTIP_INDEX, _IFS_CTIF_MASK, _IEC_CTIE_MASK, _IPC_CTIP_POSITION, _IPC_CTIS_POSITION);
    
    extern volatile ConfigurationBitsRegister DEVCFG_W __asm__("_DEVCFG_W") __attribute__((section("sfrs")));
    ConfigController configController = ConfigController(DEVCFG_W, 1, (uint32[]) {SYSKEY_UNLOCK_0, SYSKEY_UNLOCK_1, SYSKEY_UNLOCK_2}, SYSKEY_UNLOCK_SIZE, (uint32[]) {SYSKEY_LOCK_0}, SYSKEY_LOCK_SIZE, &interruptController);
    
    extern volatile PeripheralPinSelectRegister<_PPS_INVEC_MAX> PPS_IN_W __asm__("_PPS_IN_W") __attribute__((section("sfrs")));
    extern volatile PeripheralPinSelectRegister<_PPS_OUTVEC_MAX> PPS_OUT_W __asm__("_PPS_OUT_W") __attribute__((section("sfrs")));
    PeripheralPinSelectController<_PPS_INVEC_MAX, _PPS_OUTVEC_MAX> peripheralPinSelectController = PeripheralPinSelectController<_PPS_INVEC_MAX, _PPS_OUTVEC_MAX>(PPS_IN_W, _PPS_INVEC_MAX,PPS_OUT_W, _PPS_OUTVEC_MAX, configController);
    
    #define _PPS_INVEC_MAX  46
#define _PPS_OUTVEC_MAX 37
    
    
}

#endif	/* P32MX2XXFXXXB_H */